import React, { Fragment } from 'react';
// import { useNavigate } from 'react-router-dom';
import Container from "@mui/material/Container";
const PaymentAndDelivery = () => {
  // const navigate = useNavigate();
  return (
    <Fragment>
      <Container>
        <div className="payment-delivery-container">
          <h2>Доставка</h2>
          <p>Безкоштовно по всій Україні*</p>
          <p>Доставка здійснюється компанією Нова Пошта до обраного вами відділення або кур'єром. При замовленні від 2-х одиниць і більше доставка
            абсолютно безкоштовна.</p>
          <p>Після оформлення замовлення будь-яким зручним для вас способом, наші менеджери зв'яжуться з вами для уточнення місця доставки. Зазвичай
            доставка здійснюється протягом 1-3 днів після оформлення замовлення.</p>
          <p>Відправлення замовлень здійснюється два рази на день: о 12:00 і о 18:00 (щоденно).</p>
          <p>Мінімальної суми замовлення немає.</p>
          <p>При замовленні однієї одиниці товару доставка - 50 грн.</p>

          <h2>Міжнародна доставка!</h2>
          <p>Ми завжди поруч! З турботою про клієнтів, які зараз знаходяться за кордоном, ми запускаємо міжнародну доставку Meest Express.</p>
          <p>Доставка здійснюється після повної оплати замовлення на карту.</p>
          <p>Доставку оплачує клієнт.</p>
          <p>Вартість доставки залежить від країни призначення, ваги та розміру відправки.</p>
          <p>Термін доставки від двох тижнів (залежить від країни).</p>
          <p>Доставку можна замовити в усі країни, з якими працює Meest Express. Список країн можна переглянути <a
            href="https://novaposhta.ua/ru/office">тут</a>.</p>
          <p>Доставку Meest Express можна замовити лише для міжнародних відправлень.</p>

          <h2>Оплата</h2>
          <p>Оплата здійснюється готівкою при отриманні замовлення.</p>
          <p>Перед відправленням весь асортимент товару перевіряється і упаковується для безпечної транспортування. У зв'язку з цим, ми абсолютно
            впевнені в якості отриманого вами аромату. Крім цього, ви можете особисто оглянути ваші парфуми, і лише після цього здійснювати оплату в
            відділенні Нової пошти.</p>
          <p>При цьому, ніяких прихованих платежів, оплати послуг транспортної компанії, плати за переказ грошей, комісій і т.д.! Ви оплачуєте лише
            суму замовлення!</p>
          <p>Отже, отримати ваш улюблений аромат дуже просто і безпечно:</p>
          <p>Доставка здійснюється в міста, де є відділення Нової пошти. Ви можете вибрати найближчий склад на сайті Нової пошти: <a
            href="https://novaposhta.ua/ru/office">https://novaposhta.ua/ru/office</a>.</p>
          <p>Маєте питання з приводу доставки або оплати? Телефонуйте!</p>
        </div>
      </Container>
    </Fragment>
  );
};

export default PaymentAndDelivery;
